#include "AbstractPlayer.h"
#ifndef WARRIOR_H
#define WARRIOR_H


class Warrior: AbstractPlayer
{
	/*
	* 04.02.22
	* смысла сейчас эту тему писать нет, чел из осени был прав, нужно писать город
	* вообще, его идеи актуальны всегда, я допридумывал тему с сигналами, так как рил удобно и все ходы можно смести под одну гребенку
	* город можно реализовать следующим образом:
	* карта передается сначала ему
	* и он там где-то на земле рандомно строится
	* и запоминает свои координаты + получает какое-то исходное количество ресурсов
	* а вот дальше я хз
	* то есть, если делать это как игру
	* то очевидно. что нужно просто прописывать правила и какие-то просты действия
	* а если как симуляцию, то тут уже все в разы интереснее и я пока хз что делать 
	* 
	*/


};


#endif // !WARRIOR_H
